In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01  1.261683  0.981206  0.484182 -0.610796
2013-01-02 -0.627664  0.107482  0.852745 -0.627334
2013-01-03  0.002721 -0.078606  0.897145  0.737153
2013-01-04 -0.395200 -0.195822 -2.369185 -0.116464
2013-01-05  0.934317 -0.434287  0.314163  0.156248
2013-01-06  0.187536  1.072615 -0.178516 -0.765072

In [8]:
df2 = pd.DataFrame({
    'A': 1.,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3]*4, dtype='int32'),
    'E': pd.Categorical(['test', 'train', 'test', 'train']),
    'F': 'foo'
})

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
df.head()

                   A         B         C         D
2013-01-01  1.261683  0.981206  0.484182 -0.610796
2013-01-02 -0.627664  0.107482  0.852745 -0.627334
2013-01-03  0.002721 -0.078606  0.897145  0.737153
2013-01-04 -0.395200 -0.195822 -2.369185 -0.116464
2013-01-05  0.934317 -0.434287  0.314163  0.156248

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.395200 -0.195822 -2.369185 -0.116464
2013-01-05  0.934317 -0.434287  0.314163  0.156248
2013-01-06  0.187536  1.072615 -0.178516 -0.765072

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.to_numpy()

array([[ 1.26168311,  0.98120649,  0.48418241, -0.61079602],
       [-0.62766391,  0.10748152,  0.85274471, -0.62733409],
       [ 0.00272121, -0.07860617,  0.89714518,  0.73715325],
       [-0.39519963, -0.19582188, -2.36918529, -0.11646421],
       [ 0.93431721, -0.43428738,  0.31416261,  0.15624844],
       [ 0.18753612,  1.07261531, -0.17851558, -0.7650724 ]])

In [18]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.227232  0.242098  0.000089 -0.204378
std    0.740312  0.633448  1.225568  0.580122
min   -0.627664 -0.434287 -2.369185 -0.765072
25%   -0.295719 -0.166518 -0.055346 -0.623200
50%    0.095129  0.014438  0.399173 -0.363630
75%    0.747622  0.762775  0.760604  0.088070
max    1.261683  1.072615  0.897145  0.737153

In [20]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.261683   -0.627664    0.002721   -0.395200    0.934317    0.187536
B    0.981206    0.107482   -0.078606   -0.195822   -0.434287    1.072615
C    0.484182    0.852745    0.897145   -2.369185    0.314163   -0.178516
D   -0.610796   -0.627334    0.737153   -0.116464    0.156248   -0.765072

In [23]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.610796  0.484182  0.981206  1.261683
2013-01-02 -0.627334  0.852745  0.107482 -0.627664
2013-01-03  0.737153  0.897145 -0.078606  0.002721
2013-01-04 -0.116464 -2.369185 -0.195822 -0.395200
2013-01-05  0.156248  0.314163 -0.434287  0.934317
2013-01-06 -0.765072 -0.178516  1.072615  0.187536

In [24]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  0.934317 -0.434287  0.314163  0.156248
2013-01-04 -0.395200 -0.195822 -2.369185 -0.116464
2013-01-03  0.002721 -0.078606  0.897145  0.737153
2013-01-02 -0.627664  0.107482  0.852745 -0.627334
2013-01-01  1.261683  0.981206  0.484182 -0.610796
2013-01-06  0.187536  1.072615 -0.178516 -0.765072

In [25]:
df['A']

2013-01-01    1.261683
2013-01-02   -0.627664
2013-01-03    0.002721
2013-01-04   -0.395200
2013-01-05    0.934317
2013-01-06    0.187536
Freq: D, Name: A, dtype: float64

In [26]:
df[0:3]

                   A         B         C         D
2013-01-01  1.261683  0.981206  0.484182 -0.610796
2013-01-02 -0.627664  0.107482  0.852745 -0.627334
2013-01-03  0.002721 -0.078606  0.897145  0.737153

In [27]:
df[
    '20130102':'20130104'
]

                   A         B         C         D
2013-01-02 -0.627664  0.107482  0.852745 -0.627334
2013-01-03  0.002721 -0.078606  0.897145  0.737153
2013-01-04 -0.395200 -0.195822 -2.369185 -0.116464